# ExternalDefinitionCreationOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinitionCreationOptions Class
Members See Also
---
An option class used for creating a new shared parameter definition, including options such as name, type, visibility, Guid description and modifiable flag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class ExternalDefinitionCreationOptions : IDisposable
```

Visual Basic
---
```text
Public Class ExternalDefinitionCreationOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExternalDefinitionCreationOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExternalDefinitionCreationOptions
# See Also
ExternalDefinitionCreationOptions Members
Autodesk.Revit.DB Namespace